In [1]:
# 판다스 라이브러리를 불러옵니다. (: 판다스는 보통 pd로 축약하여 사용합니다.)
import pandas as pd

In [3]:
# 판다스의 데이터 프레임을 생성합니다.
# [0] 데이터 프레임에 들어갈 2열로 구성되어 있습니다. -> 필자는 하나팀 순장의 1) 이름과 2) 출생년도를 구성했습니다.
names = ['남혜빈', '이요섭', '이철현', '임민석', '조성경']
births = [1999, 1998, 1999, 1998, 1999]

# [1] list(), zip() 함수로 데이터셋을 생성합니다.
# [2] 데이터셋으로 데이터 프레임 객체를 생성합니다.
HanaDataSet = list(zip(names, births))
df = pd.DataFrame(data = HanaDataSet, columns=['Names', 'Births'])

# [3] head()로 생성된 데이터 프레임의 상단 부분을 출력합니다.
df.head()

  Names  Births
0   남혜빈    1999
1   이요섭    1998
2   이철현    1999
3   임민석    1998
4   조성경    1999

In [5]:
# --------------------------------------------------------------------------
# <데이터 프레임의 기본 정보를 출력해보자>
# 데이터 프레임의 열 타입 정보를 출력합니다.
df.dtypes

RangeIndex(start=0, stop=5, step=1)

In [6]:
# 데이터 프레임의 인덱스 정보를 출력합니다.
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
# 데이터 프레임의 열 형태 정보를 출력합니다.
df.columns

Index(['Names', 'Births'], dtype='object')

In [8]:
# ------------------------------------------------------------------------
# 행과 열을 각각 출력해보자.
# 데이터 프레임에서 하나의 열('Names')을 출력합니다.
df['Names']
# 시리즈 객체가 출력됩니다.

0    남혜빈
1    이요섭
2    이철현
3    임민석
4    조성경
Name: Names, dtype: object

In [9]:
# 데이터 프레임에서 0~3번째 인덱스를 선택합니다.
df[0:3]
# 데이터 프레임이 출력됩니다.

  Names  Births
0   남혜빈    1999
1   이요섭    1998
2   이철현    1999

In [11]:
# --------------------------------------------------------------------------
# 데이터 프레임으로 수행할 수 있는 가장 기초적인 두 가지 기능
# 1. 필터링 기능
# 출생년도가 1999보다 빠른 데이터를 선택합니다.
df[df['Births']<1999]

  Names  Births
1   이요섭    1998
3   임민석    1998

In [13]:
# 2. 평균값을 계산하는 기능
df.mean() # 연산이 가능한 열의 평균값만 반환합니다.

/var/folders/8k/qkyjfwv90l1dk_038ty806ym0000gn/T/ipykernel_4491/587838212.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Births    1998.6
dtype: float64